kenyon-mitchell01/XIAO-ESP32S3-MJPEG2SD/src/EMJPEG2SD_DopamineChaser247_Version1/utilsFS.cpp
                // Create URL with query parameters for additional info
                char uploadUrl[200];
                snprintf(uploadUrl, sizeof(uploadUrl), 
                         "http://192.168.1.193:8000/upload?device=%s&size=%u&time=%u", 
                         hostName, fileSize, (uint32_t)getEpoch());
                         
                http.begin(uploadUrl);
                http.addHeader("Content-Type", "application/octet-stream");
                http.addHeader("X-Filename", file.name());
                
                // Set timeout appropriately for large files
                http.setTimeout(min(60000, fileSize / 1024 + 10000)); // 10s + 1s per KB
                
                // Upload with chunked transfer
                const size_t CHUNK_SIZE = 8192;
                uint8_t* buffer = (uint8_t*)ps_malloc(CHUNK_SIZE);
                
                if (!buffer) {
                    LOG_WRN("Failed to allocate buffer for file upload");
                    file.close();
                    http.end();
                    continue;
                }
                
                // Use chunked upload
                http.useHTTP10(false);
                http.setIsChunkedTransfer(true);
                
                // Start the request
                int httpCode = http.startRequest("POST");
                
                if (httpCode == HTTP_CODE_OK) {
                    size_t bytesRemaining = fileSize;
                    size_t pos = 0;
                    bool uploadSuccess = true;
                    
                    while (bytesRemaining > 0) {
                        file.seek(pos);
                        size_t bytesToRead = min(CHUNK_SIZE, bytesRemaining);
                        size_t bytesRead = file.read(buffer, bytesToRead);
                        
                        if (bytesRead > 0) {
                            if (!http.sendRequestChunk((const uint8_t*)buffer, bytesRead)) {
                                LOG_WRN("Failed to send chunk at position %u", pos);
                                uploadSuccess = false;
                                break;
                            }
                            
                            bytesRemaining -= bytesRead;
                            pos += bytesRead;
                            
                            // Show progress periodically
                            if (pos % (CHUNK_SIZE * 10) == 0 || bytesRemaining == 0) {
                                LOG_INF("Upload progress: %u%%", 
                                        (uint8_t)((fileSize - bytesRemaining) * 100 / fileSize));
                            }
                            
                            // Yield to prevent watchdog trigger
                            delay(1);
                        } else {
                            LOG_WRN("Failed to read chunk at position %u", pos);
                            uploadSuccess = false;
                            break;
                        }
                    }
                    
                    // Finish the request
                    if (uploadSuccess) {
                        http.endRequest();
                        httpCode = http.getResponse();
                        
                        if (httpCode == HTTP_CODE_OK) {
                            LOG_INF("Successfully uploaded: %s", filepath);
                            uploadedCount++;
                        } else {
                            LOG_WRN("Upload completed but server returned: %d", httpCode);
                        }
                    }
                } else {
                    LOG_WRN("Failed to start upload, code: %d", httpCode);
                }
                
                free(buffer);
                http.end();
            } else {
                LOG_WRN("Empty file, skipping: %s", filepath);
            }
        }
        
        file.close();
        file = root.openNextFile();
    }
    
    root.close();
    LOG_INF("Upload session complete. Uploaded %d out of %d files", uploadedCount, fileCount);
}

/*void uploadRecordings() {
    File root = SD_MMC.open("/data"); // Changed from SD to SD_MMC
    if (!root) {
        LOG_WRN("Failed to open /data");
        return;
    }
    while (File dir = root.openNextFile()) {
        if (dir.isDirectory()) {
            File file = dir.openNextFile();
            while (file) {
                char filepath[FILE_NAME_LEN];
                snprintf(filepath, FILE_NAME_LEN, "/data/%s/%s", dir.name(), file.name());
                uploadToComputer(filepath);
                file = dir.openNextFile();
            }
        }
    }
    root.close();
}

//*void uploadRecordings() {
    // Placeholder implementation
    //*Serial.println("uploadRecordings() called - placeholder");
    // Add your upload logic here later
//*}